Repository: common-repository/woo-payment-gateway-for-piraeus-bank
Catalog: languages/woo-payment-gateway-for-piraeus-bank-*.po
Languages: el

source: Piraeus bank Payment Gateway allows you to accept payment through various channels such as Maestro, Mastercard, AMex cards, Diners and Visa cards On your Woocommerce Powered Site.
el: Το σύστημα πληρωμών της Πειραιώς σας επιτρέπει να λαμβάνετε πληρωμές μέσω καρτών Maestro, Mastercard, American Express, Diners και Visa στο Woocommerce ηλεκτρονικό κατάστημά σας.

source: Cardholder Name
el: Όνομα Κατόχου Κάρτας (λατινικούς χαρακτήρες)

source: Insert card holder name as required by Piraeus bank for validation
el: Εισάγετε το όνομα κατόχου κάρτας για τη 3D Secure διαδικασία της τρ. Πειραιώς

source: Piraeus Bank Gateway
el: Με κάρτα μέσω Πειραιώς

source: Piraeus Bank Gateway allows you to accept payment through various channels such as Maestro, Mastercard, AMex cards, Diners and Visa cards.
el: Το σύστημα πληρωμών της Πειραιώς σας επιτρέπει να λαμβάνετε πληρωμές μέσω καρτών Maestro, Mastercard, American Express, Diners και Visa.

source: Technical data to be submitted to Piraeus Bank
el: Στοιχεία για διασύνδεση με την τράπεζα

source: The data to be submitted to Piraeus Bank(<a href="mailto:epayments@piraeusbank.gr">epayments@piraeusbank.gr</a>) in order to provide the necessary technical info (test/live account) for transactions are as follows
el: Οι πληροφορίες που πρέπει να σταλούν στην Τράπεζα Πειραιώς (<a href=“mailto:epayments@piraeusbank.gr”>epayments@piraeusbank.gr</a>) προκειμένου να δοθούν οι απαραίτητες τεχνικές πληροφορίες (test/live account) για να γίνουν συναλλαγές, είναι οι εξής

source: <strong>SOAP have to be enabled in your Server/Hosting</strong>, it is required for this plugin to work properly!
el: <strong> Θα πρέπει να έχετε ενεργοποιημένο το SOAP στον Server/Hosting σας</strong>, είναι απαραίτητο για να λειτουργήσει σωστά το plugin!

source: <strong>Important Notice:</strong> Piraeus Bank has announced that it will gradually abolish the Preauthorized Payment Service for all merchants, beginning from the ones obtained MIDs from 29/1/2019 onwards.<br /> You are highly recommended to disable the preAuthorized Payment Service as soon as possible.
el: <strong>Σημαντική Ενημέρωση:</strong> Η Τράπεζα Πειραιώς ανακοίνωσε ότι προχωρά σε σταδιακή κατάργηση της υπηρεσίας Προ-έγκρισης πληρωμών που ήταν διαθέσιμη για τους εμπόρους. <br />Ήδη η κατάργηση έχει εφαρμοστεί στα MID που έχουν δημιουργηθεί μετά τις 29/1/2019.<br /> Σας συνιστούμε να απενεργοποιήσετε την υπηρεσίας Προ-έγκρισης πληρωμών το συντομότερο δυνατόν.

source: Enable/Disable
el: Ενεργοποίηση/Απενεργοποίηση

source: Enable Piraeus Bank Gateway
el: Ενεργοποίηση συστήματος πληρωμών Τράπεζας Πειραιώς

source: Enable or disable the gateway.
el: Ενεργοποίηση ή απενεργοποίηση συστήματος πληρωμών.

source: Title
el: Τίτλος

source: This controls the title which the user sees during checkout.
el: Ελέγχει το τίτλο που εμφανίζεται στο χρήστη κατά τη πληρωμή.

source: Description
el: Περιγραφή

source: This controls the description which the user sees during checkout.
el: Ελέγχει την περιγραφή που εμφανίζεται στον χρήστη κατά τη πληρωμή.

source: Pay Via Piraeus Bank: Accepts Mastercard, Visa cards and etc.
el: Πληρωμή μέσω Τράπεζας Πειραιώς: Δέχεται Mastercard, Visa και Maestro.

source: Display the logo of Piraeus Bank
el: Εμφάνιση του λογότυπου της Τράπεζας Πειραιώς

source: Enable to display the logo of Piraeus Bank next to the title which the user sees during checkout.
el: Επιλέξτε για να εμφανίζεται το λογότυπο της τράπεζας δίπλα από το κείμενο πληρωμής με κάρτα, κατά την πληρωμή.

source: Piraeus Bank Merchant ID
el: Merchant ID Τράπεζας Πειραιώς

source: Enter Your Piraeus Bank Merchant ID
el: Εισάγεται το Merchant ID από τη Τράπεζα Πειραιώς

source: Piraeus Bank Acquirer ID
el: Acquirer ID Τράπεζας Πειραιώς

source: Enter Your Piraeus Bank Acquirer ID
el: Εισάγεται το Acquirer ID της Τράπεζας Πειραιώς

source: Piraeus Bank POS ID
el: POS ID Τράπεζας Πειραιώς

source: Enter your Piraeus Bank POS ID
el: Εισάγεται το POS ID της Τράπεζας Πειραιώς

source: Piraeus Bank Username
el: Username Τράπεζας Πειραιώς

source: Enter your Piraeus Bank Username
el: Εισάγεται το Username της Τράπεζας Πειραιώς

source: Piraeus Bank Password
el: Password Τράπεζας Πειραιώς

source: Enter your Piraeus Bank Password
el: Εισάγεται το Password της Τράπεζας Πειραιώς

source: Used when your server is not behind a static IP. Leave blank for normal HTTP connection.
el: Συμπληρώστε το hostname του Proxy Server. Χρησιμοποιείται για websites που δεν έχουν στατική IP. Αφήστε κενό για κανονική HTTP σύνδεση.

source: Used with Proxy Host.
el: Χρησιμοποιείται σε συνδυασμό με το Proxy Host.

source: Used with Proxy Host. Leave blank for anonymous connection.
el: Χρησιμοποιείται σε συνδυασμό με το Proxy Host. Αφήστε κενό για ανώνυμη σύνδεση.

source: Used with Proxy Host. Leave blank for anonymous connection.
el: Χρησιμοποιείται σε συνδυασμό με το Proxy Host. Αφήστε κενό για ανώνυμη σύνδεση.

source: Pre-Authorize
el: Προ-Έγκριση

source: Enable to capture preauthorized payments
el: Ενεργοποιήστε για να συλλέγεται προεγκεκριμένες πληρωμές

source: <strong>Important Notice:</strong> Piraeus Bank has announced that it will gradually abolish the Preauthorized Payment Service for all merchants, beginning from the ones obtained MIDs from 29/1/2019 onwards.<br /> Default payment method is Purchase, enable for Pre-Authorized payments. You will then need to accept them from Piraeus Bank AdminTool
el: <strong>Σημαντική Ενημέρωση:</strong> Η Τράπεζα Πειραιώς ανακοίνωσε ότι προχωρά σε σταδιακή κατάργηση της υπηρεσίας Προ-έγκρισης πληρωμών που ήταν διαθέσιμη για τους εμπόρους. <br />Ήδη η κατάργηση έχει εφαρμοστεί στα MID που έχουν δημιουργηθεί μετά τις 29/1/2019.<br /> Σας συνιστούμε να απενεργοποιήσετε την υπηρεσίας Προ-έγκρισης πληρωμών το συντομότερο δυνατόν

source: Return page URL <br />(Successful or Failed Transactions)
el: Σελίδα Επιστροφής <br />(Επιτυχείς ή Αποτυχημένες Συναλλαγές)

source: We recommend you to select the default “Thank You Page”, in order to automatically serve both successful and failed transactions, with the latter also offering the option to try the payment again.<br /> If you select a different page, you will have to handle failed payments yourself by adding custom code.
el: Συστήνουμε την επιλογή της default “Σελίδα : Ευχαριστούμε για την αγορά”, ώστε να γίνεται αυτόματα και σωστά η ανακατεύθυνση επιτυχημένων και αποτυχημένων συναλλαγών, δίνοντας την επιλογή στις δεύτερες για επαναπροσπάθεια της πληρωμής.<br /> Εάν επιλέξετε διαφορετική σελίδα, θα πρέπει εσείς να προσθέσετε χειροκίνητα κώδικα στη σελίδα για να λειτουργεί σωστά.

source: Maximum number of installments regardless of the total order amount
el: Μέγιστες άτοκες δόσεις ανεξαρτήτως ποσού παραγγελίας

source: 1 to 24 Installments,1 for one time payment. You must contact Piraeus Bank first<br /> If you have filled the "Max Number of installments depending on the total order amount", the value of this field will be ignored.
el: 1 έως 24 άτοκες Δόσεις, 1 για εφάπαξ πληρωμή. Για ενεργοποίηση των δόσεων πρέπει να έχετε επικοινωνήσει με τη Τράπεζα Πειραιώς<br /> Εαν έχετε συμπλήρώσει το πεδίο “Μέγιστες άτοκες δόσεις ανάλογα με το ποσό παραγγελίας”, η τιμή του παρόντος πεδίου θα αγνοηθεί.

source: Maximum number of installments depending on the total order amount
el: Μέγιστες άτοκες δόσεις ανάλογα με το ποσό παραγγελίας

source: Example 80:2, 160:4, 300:8</br> total order greater or equal to 80 -> allow 2 installments, total order greater or equal to 160 -> allow 4 installments, total order greater or equal to 300 -> allow 8 installments</br> Leave the field blank if you do not want to limit the number of installments depending on the amount of the order.
el: Παράδειγμα: 80:2, 160:4, 300:8</br> Κόστος παραγγελίας: για 80€ και πάνω: δυνατότητα για 2 δόσεις, για 160€ και πάνω: δυνατότητα για 4 δόσεις, για 300€ και πάνω: δυνατότητα για 8 δόσεις</br> Αφήστε κενό το πεδίο εάν δεν θέλετε να περιορίσετε τον αριθμό των δόσεων ανάλογα με το ποσό της παραγγελία.

source: Enable Cardholder Name Field
el: Ενεργοποίηση πεδίου για Όνομα Κατόχου Κάρτας

source: Enabling this field allows customers to insert a cardholder name
el: Η ενεργοποίηση αυτού του πεδίου επιτρέπει στους πελάτες να εισάγουν το όνομα κατόχου κάρτας

source: According to Piraeus bank’s technical requirements related to 3D secure and SCA, the cardholder’s name must be sent before the customer is redirected to the bank’s payment environment. If you choose not to show this field, we will automatically send the full name inserted for the order, with the risk of having the bank refusing the transaction due to the validity of this field.
el: Με βάση τις τεχνικές προδιαγραφές της τρ. Πειραιώς για το 3D Secure, είναι υποχρεωτικό το όνομα κατόχου της κάρτας να στέλνεται πριν μεταβεί ο πελάτης στο περιβάλλον της τράπεζας. Εάν επιλέξετε να μην το εμφανίσετε, ως όνομα κατόχου κάρτας θα στέλνεται αυτόματα το ονοματεπώνυμο των στοιχείων χρέωσης της παραγγελίας, με το ρίσκο να υπάρξουν απορρίψεις συναλλαγών από την τράπεζα σε περίπτωση ελέγχου της εγκυρότητας του πεδίου.

source: Enable Debug mode
el: Ενεργοποίηση λειτουργίας εντοπισμού σφαλμάτων

source: Enabling this will log certain information
el: Η ενεργοποίηση αυτής της δυνατότητας θα καταγράψει ορισμένες πληροφορίες

source: Enabling this (and the debug mode from your wp-config file) will log information, e.g. bank responses, which will help in debugging issues.
el: Η ενεργοποίηση αυτής της δυνατότητας (και της λειτουργίας εντοπισμού σφαλμάτων από το αρχείο wp-config) θα καταγράψει πληροφορίες, π.χ. τραπεζικές απαντήσεις, οι οποίες θα βοηθήσουν σε ζητήματα εντοπισμού σφαλμάτων.

source: Enable 2nd “payment received” email
el: Ενεργοποίηση αποστολής του 2ου email “Η πληρωμή έχει ληφθεί”

source: Enable sending Customer order note with transaction details
el: Ενεργοποίηση αποστολής Σημείωσης παραγγελίας με τις πληροφορίες της συναλλαγής

source: Enabling this will send an email with the support reference id and transaction id to the customer, after the transaction has been completed (either on success or failure)
el: Ενεργοποιώντας αυτή τη λειτουργία, θα αποστέλλετε email με το support reference Id και το id συναλλαγής στον πελάτη, μετά την ολοκλήρωση της συναλλαγής (είτε επιτυχημένη είτε αποτυχήμενη)

source: Thank you page
el: Σελίδα : Ευχαριστούμε για την αγορά

source: Choose Installments
el: Επιλογή Δόσεων

source: Without installments
el: Χωρίς δόσεις

source: Thank you for your order. We are now redirecting you to Piraeus Bank to make payment.
el: Ευχαριστούμε για τη παραγγελία. Σας ανακατευθύνουμε στη Τράπεζα Πειραιώς για να πραγματοποιηθεί πληρωμή.

source: Pay via Pireaus Bank
el: Πληρωμή μέσω Τράπεζας Πειραιώς

source: Cancel order &amp; restore cart
el: Ακύρωση παραγγελίας &amp; άδειασμα καλαθιού

source: An error occured, please contact the Administrator.
el: Συνέβει ένα σφάλμα, επικοινωνήστε με το Διαχειριστή.

source: Error
el: Σφάλμα

source: Thank you - your order is now pending payment. You should be automatically redirected to Piraeus Paycenter to make payment.
el: Ευχαριστούμε - η παραγγελία σας αναμένει πληρωμή. Θα ανακατευθυνθείτε αυτόματα στο Paycenter της Τράπεζας Πειραιώς για να πραγματοποιήσετε την πληρωμή.

source: A technical problem occured. <br />The transaction wasn't successful, payment wasn't received.
el: Ένα τεχνικό πρόβλημα συνέβει. <br /> Η συναλλαγή δεν ήταν επιτυχής, δε λάβαμε πληρωμή.

source: Payment error:
el: Σφάλμα Πληρωμής:

source: Thank you for shopping with us. <br />However, the transaction wasn't successful, payment wasn't received.
el: Σας ευχαριστούμε για την προτίμησή σας!<br /> Η συναλλαγή δεν ήταν επιτυχής, δε λάβαμε πληρωμή.

source: Payment Via Peiraeus Bank<br />Transaction ID:
el: Πληρωμή μέσω Τράπεζας Πειραιώς<br /> ID Συναλλαγής:

source: Thank you for shopping with us.<br />Your transaction was successful, payment was received.<br />Your order is currently being processed.
el: Σας ευχαριστούμε για την προτίμησή σας!<br /> Η συναλλαγή ήταν επιτυχής, λάβαμε τη πληρωμή. <br /> H παραγγελία σας βρίσκεται υπό επεξεργασία.

source: Payment Received.<br />Your order is currently being processed.<br />We will be shipping your order to you soon.<br />Peiraeus Bank ID:
el: Η πληρωμή έχει ληφθεί. <br /> Η παραγγελία σας είναι υπό επεξεργασία. <br /> Θα σας αποστείλουμε τη παραγγελία σας το συντομότερο δυνατό.<br /> ID Συναλλαγής Τράπεζας Πειραιώς:

source: Thank you for shopping with us.<br />Your transaction was successful, payment was received.<br />Your order is now complete.
el: Σας ευχαριστούμε για την προτίμησή σας!<br /> Η συναλλαγή ήταν επιτυχής, λάβαμε τη πληρωμή. <br /> H παραγγελία σας έχει ολοκληρωθεί.

source: Payment Received.<br />Your order is now complete.<br />Peiraeus Transaction ID:
el: Λάβαμε την πληρωμή. <br /> Η παραγγελία σας έχει ολοκληρωθεί.<br /> ID Συναλλαγής Τράπεζας Πειραιώς:

source: Thank you for shopping with us.<br />Your transaction was previously received.<br />
el: Ευχαριστούμε που πραγματοποιήσατε τις αγορές σας. <br /> Η συναλλαγή έχει πραγματοποιηθεί ήδη. <br />

source: Cardholder name is mandatory
el: το όνομα κατόχου της κάρτας είναι υποχρεωτικό ( Σημείωση: σε λατινικούς χαρακτήρες)

source: Ammochostos
el: Αμμόχωστος

source: Keryneia
el: Κερύvεια

source: Larnaka
el: Λάρνακα

source: Lefkosia
el: Λευκωσία

source: Lemesos
el: Λεμεσός

source: Pafos
el: Πάφος
